I am unable to reproduce using the config above (with valid email addresses), commenting out account_id/api_key/admin_api_key and sending those via environment variables.

### Config

```
provider "newrelic" {
  # https://github.com/newrelic/terraform-provider-newrelic/releases/latest
  version = "2.2.1"
  region = "US"
  #account_id = "<REDACTED>"
  #api_key = "<REDACTED>"
  #admin_api_key = "<REDACTED>"
}

resource "newrelic_alert_policy" "foo" {
  name = "example"
  incident_preference = "PER_POLICY" # PER_POLICY is default
}

resource "newrelic_alert_channel" "first" {
  name = "bar"
  type = "email"

  config {
    recipients              = "<REDACTED>"
    include_json_attachment = "1"
  }
}

resource "newrelic_alert_channel" "second" {
  name = "bar"
  type = "email"

  config {
    recipients              = "<REDACTED>"
    include_json_attachment = "1"
  }
}

resource "newrelic_alert_policy_channel" "testing" {
  policy_id = newrelic_alert_policy.foo.id
  channel_ids = [
    newrelic_alert_channel.first.id,
    newrelic_alert_channel.second.id,
  ]
}
```

### Shell execution

```
$ terraform init

Initializing the backend...

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "newrelic" (terraform-providers/newrelic) 2.2.1...


$ export NEW_RELIC_API_KEY=<REDACTED>
$ export NEW_RELIC_ADMIN_API_KEY=<REDACTED>
$ export NEW_RELIC_ACCOUNT_ID=<REDACTED>
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_alert_channel.first will be created
  + resource "newrelic_alert_channel" "first" {
      + id   = (known after apply)
      + name = "bar"
      + type = "email"

      + config {
          + include_json_attachment = "1"
          + recipients              = "<REDACTED>"
        }
    }

  # newrelic_alert_channel.second will be created
  + resource "newrelic_alert_channel" "second" {
      + id   = (known after apply)
      + name = "bar"
      + type = "email"

      + config {
          + include_json_attachment = "1"
          + recipients              = "<REDACTED>"
        }
    }

  # newrelic_alert_policy.foo will be created
  + resource "newrelic_alert_policy" "foo" {
      + account_id          = <REDACTED>
      + id                  = (known after apply)
      + incident_preference = "PER_POLICY"
      + name                = "example"
    }

  # newrelic_alert_policy_channel.testing will be created
  + resource "newrelic_alert_policy_channel" "testing" {
      + channel_ids = (known after apply)
      + id          = (known after apply)
      + policy_id   = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

newrelic_alert_policy.foo: Creating...
newrelic_alert_channel.first: Creating...
newrelic_alert_channel.second: Creating...
newrelic_alert_policy.foo: Creation complete after 1s [id=982341]
newrelic_alert_channel.first: Creation complete after 1s [id=3820899]
newrelic_alert_channel.second: Creation complete after 1s [id=3820898]
newrelic_alert_policy_channel.testing: Creating...
newrelic_alert_policy_channel.testing: Creation complete after 1s [id=982341:3820898:3820899]
```